Tekla.Structures.Drawing.DimensionSetBaseAttributes.CombineFormats
The combined dimension formats.

Tekla.Structures.Drawing.DimensionSetBaseAttributes.CombineFormats.Off
No combining.

Tekla.Structures.Drawing.DimensionSetBaseAttributes.CombineFormats.NumberOfItemsTimesLength
The number of items times the dimension length. E.g. 3*60.

Tekla.Structures.Drawing.DimensionSetBaseAttributes.CombineFormats.NumberOfItemsTimesLengthEqualsResult
The number of items times the dimension length equals the result. E.g. 3*60=180.